Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_flash.h
  /* Exit critical section: restore previous priority mask */
  __set_PRIMASK(primask_bit);
}

/**
  * @}
  */

/** @defgroup FLASH_LL_EF_WRP_Management WRP Management
  * @{
  */

/**
  * @brief  Set WRP Address
  * @rmtoll WRPR        WRP             LL_FLASH_SetWRPRAddress
  * @param  FLASHx FLASH Instance
  * @param  Address This parameter can be a combination of the following values:
  *         @arg @ref LL_FLASH_WRP_DISABLE
  *         @arg @ref LL_FLASH_WRP_BLOCK_0
  *         @arg @ref LL_FLASH_WRP_BLOCK_1
  *         @arg @ref LL_FLASH_WRP_BLOCK_2
  *         @arg @ref LL_FLASH_WRP_BLOCK_3
  *         @arg @ref LL_FLASH_WRP_BLOCK_4
  *         @arg @ref LL_FLASH_WRP_BLOCK_5
  *         @arg @ref LL_FLASH_WRP_BLOCK_6
  *         @arg @ref LL_FLASH_WRP_BLOCK_7
  *         @arg @ref LL_FLASH_WRP_Pages0to127
  *         @arg @ref LL_FLASH_WRP_Pages128to255
  *         @arg @ref LL_FLASH_WRP_Pages256to383
  *         @arg @ref LL_FLASH_WRP_Pages384to511
  *         @arg @ref LL_FLASH_WRP_Pages512to639
  *         @arg @ref LL_FLASH_WRP_Pages640to767
  *         @arg @ref LL_FLASH_WRP_Pages768to895
  *         @arg @ref LL_FLASH_WRP_Pages896to1023
  *         @arg @ref LL_FLASH_WRP_AllPages
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetWRPRAddress(FLASH_TypeDef *FLASHx,uint32_t Address)
{
  MODIFY_REG(FLASHx->WRPR, FLASH_WRPR_WRP, ((~(Address) & 0xFFFF) & (FLASH_WRPR_WRP)));
}

/**
  * @brief  Get WRP Address
  * @rmtoll WRPR        WRP             LL_FLASH_GetWRPRAddress
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be a combination of the following values:
  *         @arg @ref LL_FLASH_WRP_DISABLE
  *         @arg @ref LL_FLASH_WRP_BLOCK_0
  *         @arg @ref LL_FLASH_WRP_BLOCK_1
  *         @arg @ref LL_FLASH_WRP_BLOCK_2
  *         @arg @ref LL_FLASH_WRP_BLOCK_3
  *         @arg @ref LL_FLASH_WRP_BLOCK_4
  *         @arg @ref LL_FLASH_WRP_BLOCK_5
  *         @arg @ref LL_FLASH_WRP_BLOCK_6
  *         @arg @ref LL_FLASH_WRP_BLOCK_7
  *         @arg @ref LL_FLASH_WRP_Pages0to127
  *         @arg @ref LL_FLASH_WRP_Pages128to255
  *         @arg @ref LL_FLASH_WRP_Pages256to383
  *         @arg @ref LL_FLASH_WRP_Pages384to511
  *         @arg @ref LL_FLASH_WRP_Pages512to639
  *         @arg @ref LL_FLASH_WRP_Pages640to767
  *         @arg @ref LL_FLASH_WRP_Pages768to895
  *         @arg @ref LL_FLASH_WRP_Pages896to1023
  *         @arg @ref LL_FLASH_WRP_AllPages
  */
__STATIC_INLINE uint32_t LL_FLASH_GetWRPRAddress(FLASH_TypeDef *FLASHx)
{
  return (~(READ_BIT(FLASHx->WRPR, FLASH_WRPR_WRP))) & (FLASH_WRPR_WRP);
}

/**
  * @brief  Set PCROP
  * @rmtoll PCROPR0        PCROP0SR             LL_FLASH_SetBank0PCROP
  * @rmtoll PCROPR0        PCROP0ER             LL_FLASH_SetBank0PCROP
  * @param  FLASHx FLASH Instance
  * @param  PCROPStartAddr This parameter can be StartAdress of bank0 pcrop
  * @param  PCROPEndAddr This parameter can be EndAdress of bank0 pcrop
  * @retval None
  */
__STATIC_INLINE uint32_t LL_FLASH_SetBank0PCROP(FLASH_TypeDef *FLASHx, uint32_t PCROPStartAddr,uint32_t PCROPEndAddr)
{
  uint32_t reg_value;
  uint32_t bank0_addr;

  /* Get the information about the bank swapping */
  if (READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_BFB) == 0U)
  {
    bank0_addr = FLASH_BASE;
  }
  else
  {
    bank0_addr = FLASH_BASE + (FLASH_SIZE >> 1);
  }

  /* Configure the Proprietary code readout protection */
  if((PCROPStartAddr >= bank0_addr) && (PCROPEndAddr < (bank0_addr + (FLASH_SIZE >> 1))))
  {
    /* Calculate the location of the PCROPStartAddr in FLASH */
    reg_value = ((PCROPStartAddr - bank0_addr) >> 9);
    MODIFY_REG(FLASH->PCROP0SR, FLASH_PCROP0SR_PCROP0SR, reg_value);

    reg_value = ((PCROPEndAddr - bank0_addr) >> 9);
    MODIFY_REG(FLASH->PCROP0ER, FLASH_PCROP0ER_PCROP0ER, reg_value);
  }
  else
  {
    /* PCROPStartAddr or PCROPEndAddr is Invalid address */
    return ERROR;
  }

  return SUCCESS;
}

/**
  * @brief  Set PCROP
  * @rmtoll PCROPR1        PCROP1SR             LL_FLASH_SetBank1PCROP
  * @rmtoll PCROPR1        PCROP1ER             LL_FLASH_SetBank1PCROP
  * @param  FLASHx FLASH Instance
  * @param  PCROPStartAddr This parameter can be StartAdress of bank1 pcrop
  * @param  PCROPEndAddr This parameter can be EndAdress of bank1 pcrop
  * @retval None
  */
__STATIC_INLINE uint32_t LL_FLASH_SetBank1PCROP(FLASH_TypeDef *FLASHx, uint32_t PCROPStartAddr,uint32_t PCROPEndAddr)
{
  uint32_t reg_value;
  uint32_t bank1_addr;

  /* Get the information about the bank swapping */
  if (READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_BFB) == 0U)
  {
    bank1_addr = FLASH_BASE + (FLASH_SIZE >> 1);
  }
  else
  {
    bank1_addr = FLASH_BASE;
  }

  /* Configure the Proprietary code readout protection */
  if((PCROPStartAddr >= bank1_addr) && (PCROPEndAddr < (bank1_addr + (FLASH_SIZE >> 1))))
  {
    /* Calculate the location of the PCROPStartAddr in FLASH */
    reg_value = ((PCROPStartAddr - bank1_addr) >> 9);
    MODIFY_REG(FLASH->PCROP1SR, FLASH_PCROP1SR_PCROP1SR, reg_value);

    reg_value = ((PCROPEndAddr - bank1_addr) >> 9);
    MODIFY_REG(FLASH->PCROP1ER, FLASH_PCROP1ER_PCROP1ER, reg_value);
  }
  else
  {
    /* PCROPStartAddr or PCROPEndAddr is Invalid address */
    return ERROR;
  }

  return SUCCESS;
}

/**
  * @brief  Get PCROP
  * @rmtoll PCROPR0        PCROP0SR             LL_FLASH_GetBank0PCROP
  * @rmtoll PCROPR0        PCROP0ER             LL_FLASH_GetBank0PCROP
  * @param  FLASHx FLASH Instance
  * @param  PCROPStartAddr This parameter can be StartAdress of bank0 pcrop
  * @param  PCROPEndAddr This parameter can be EndAdress of bank0 pcrop
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_GetBank0PCROP(FLASH_TypeDef *FLASHx, uint32_t *PCROPStartAddr,uint32_t *PCROPEndAddr)
{
  uint32_t reg_value;
  uint32_t bank0_addr;

  /* Get the information about the bank swapping */
  if (READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_BFB) == 0U)
  {
    bank0_addr = FLASH_BASE;
  }
  else
  {
    bank0_addr = FLASH_BASE + (FLASH_SIZE >> 1);
  }

  /* Calculate PCROPStartAddr by FLASH->PCROP0SR */
  reg_value       = ((READ_REG(FLASH->PCROP0SR) & FLASH_PCROP0SR_PCROP0SR) << 9);
  *PCROPStartAddr = (reg_value) + bank0_addr;

