Firmament-Autopilot/FMT-Firmware/target/eway/battle-flight/libraries/py32_lib/PY32E407_HAL_Driver/Inc/py32e407_ll_flash.h
  /* Calculate PCROPEndAddr by FLASH->PCROP0ER */
  reg_value     = ((READ_REG(FLASH->PCROP0ER) & FLASH_PCROP0ER_PCROP0ER) << 9);
  *PCROPEndAddr = (reg_value) + bank0_addr;
}

/**
  * @}
  */

/**
  * @brief  Get PCROP
  * @rmtoll PCROPR1        PCROP1SR             LL_FLASH_GetBank1PCROP
  * @rmtoll PCROPR1        PCROP1ER             LL_FLASH_GetBank1PCROP
  * @param  FLASHx FLASH Instance
  * @param  PCROPStartAddr This parameter can be StartAdress of bank1 pcrop
  * @param  PCROPEndAddr This parameter can be EndAdress of bank1 pcrop
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_GetBank1PCROP(FLASH_TypeDef *FLASHx, uint32_t *PCROPStartAddr,uint32_t *PCROPEndAddr)
{
  uint32_t reg_value;
  uint32_t bank1_addr;

  /* Get the information about the bank swapping */
  if (READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_BFB) == 0U)
  {
    bank1_addr = FLASH_BASE + (FLASH_SIZE >> 1);
  }
  else
  {
    bank1_addr = FLASH_BASE;
  }

  /* Calculate PCROPStartAddr by FLASH->PCROP1SR */
  reg_value       = ((READ_REG(FLASH->PCROP1SR) & FLASH_PCROP1SR_PCROP1SR) << 9);
  *PCROPStartAddr = (reg_value) + bank1_addr;

  /* Calculate PCROPEndAddr by FLASH->PCROP1ER */
  reg_value     = ((READ_REG(FLASH->PCROP1ER) & FLASH_PCROP1ER_PCROP1ER) << 9);
  *PCROPEndAddr = (reg_value) + bank1_addr;
}

/**
  * @}
  */

/**
  * @brief  Set Optr
  * @rmtoll OPTR1           RDP                 LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           IWDG_STOP           LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           IWDG_STDBY          LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           BFB                 LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           IWDG_SW             LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           NRST_STOP           LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           NRST_STDBY          LL_FLASH_SetOPTR1
  * @rmtoll OPTR1           WWDG_SW             LL_FLASH_SetOPTR1
  * @param  FLASHx FLASH Instance
  * @param  USERType This parameter can be a combination of following values:
  *         @arg @ref LL_FLASH_OPTR_RDP
  *         @arg @ref LL_FLASH_OPTR_IWDG_STOP
  *         @arg @ref LL_FLASH_OPTR_IWDG_STDBY
  *         @arg @ref LL_FLASH_OPTR_BFB
  *         @arg @ref LL_FLASH_OPTR_IWDG_SW
  *         @arg @ref LL_FLASH_OPTR_NRST_STOP
  *         @arg @ref LL_FLASH_OPTR_NRST_STDBY
  *         @arg @ref LL_FLASH_OPTR_WWDG_SW
  * @param  USERConfig Optr value need to be config by USERType
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetOPTR1(FLASH_TypeDef *FLASHx,uint32_t USERType,uint32_t USERConfig)
{
  MODIFY_REG(FLASHx->OPTR1, USERType, (USERConfig & 0xFFFFU));
}

/**
  * @brief  Set Optr
  * @rmtoll OPTR2           NBOOT1              LL_FLASH_SetOPTR2
  * @rmtoll OPTR2           NRST_MODE           LL_FLASH_SetOPTR2
  * @rmtoll OPTR2           SRAM_PE             LL_FLASH_SetOPTR2
  * @rmtoll OPTR2           CCMSRAM_RST         LL_FLASH_SetOPTR2
  * @rmtoll OPTR2           NSWBOOT0            LL_FLASH_SetOPTR2
  * @rmtoll OPTR2           NBOOT0              LL_FLASH_SetOPTR2
  * @rmtoll OPTR2           BOOT_LOCK           LL_FLASH_SetOPTR2
  * @param  FLASHx FLASH Instance
  * @param  USERType This parameter can be a combination of following values:
  *         @arg @ref LL_FLASH_OPTR_NBOOT1 
  *         @arg @ref LL_FLASH_OPTR_NRST_MODE
  *         @arg @ref LL_FLASH_OPTR_NRST_MODE0
  *         @arg @ref LL_FLASH_OPTR_NRST_MODE1
  *         @arg @ref LL_FLASH_OPTR_SRAM_PE
  *         @arg @ref LL_FLASH_OPTR_CCMSRAM_RST 
  *         @arg @ref LL_FLASH_OPTR_NSWBOOT0
  *         @arg @ref LL_FLASH_OPTR_NBOOT0
  *         @arg @ref LL_FLASH_OPTR_BOOT_LOCK
  * @param  USERConfig Optr value need to be config by USERType
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetOPTR2(FLASH_TypeDef *FLASHx,uint32_t USERType,uint32_t USERConfig)
{
  MODIFY_REG(FLASHx->OPTR2, USERType, (USERConfig & 0xFFFFU));
}

/**
  * @brief Get BOOT Lock
  * @rmtoll OPTR1        BOOT_LOCK          LL_FLASH_GetBOOTLock
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_BOOT_FROM_OB
  *         @arg @ref LL_FLASH_BOOT_FROM_MAINFLASH
  */
__STATIC_INLINE uint32_t LL_FLASH_GetBOOTLock(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR2, FLASH_OPTR2_BOOT_LOCK);
}

/**
  * @brief Get BFB Mode
  * @rmtoll OPTR1        BFB          LL_FLASH_GetBFBMode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_BFB_START_BANK0
  *         @arg @ref LL_FLASH_BFB_START_BANK1
  */
__STATIC_INLINE uint32_t LL_FLASH_GetBFBMode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_BFB);
}

/**
  * @brief Get NBoot1 Mode
  * @rmtoll OPTR2        NBOOT1          LL_FLASH_GetnBOOT1Mode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_NBOOT1_SRAM
  *         @arg @ref LL_FLASH_NBOOT1_SYSTEM
  */
__STATIC_INLINE uint32_t LL_FLASH_GetnBOOT1Mode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR2, FLASH_OPTR2_NBOOT1);
}

/**
  * @brief Get NRST Mode
  * @rmtoll OPTR2        NRST_MODE          LL_FLASH_GetNrstMode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_NRST_MODE_RESET_INPUT_ONLY
  *         @arg @ref LL_FLASH_NRST_MODE_GPIO
  *         @arg @ref LL_FLASH_NRST_MODE_RESET_INPUT_OUTPUT
  */
__STATIC_INLINE uint32_t LL_FLASH_GetNrstMode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR2, FLASH_OPTR2_NRST_MODE);
}

/**
  * @brief Get SRAM_PE Mode
  * @rmtoll OPTR2        SRAM_PE          LL_FLASH_GetSRAMPE
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_SRAM_PARITY_DISABLE
  *         @arg @ref LL_FLASH_SRAM_PARITY_ENABLE
  */
 __STATIC_INLINE uint32_t LL_FLASH_GetSRAMPE(FLASH_TypeDef *FLASHx)
 {
   return READ_BIT(FLASHx->OPTR2, FLASH_OPTR2_SRAM_PE);
 }
 
/**
  * @brief Get WWDG Mode
  * @rmtoll OPTR1        WWDG_SW          LL_FLASH_GetWWDGMode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_WWDG_MODE_HW
  *         @arg @ref LL_FLASH_WWDG_MODE_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_GetWWDGMode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_WWDG_SW);
}

/**
  * @brief Get IWDG Mode
  * @rmtoll OPTR1        IWDG_SW          LL_FLASH_GetIWDGMode
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_IWDG_MODE_HW
  *         @arg @ref LL_FLASH_IWDG_MODE_SW
  */
__STATIC_INLINE uint32_t LL_FLASH_GetIWDGMode(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_IWDG_SW);
}

/**
  * @brief Get IWDG In Stop
  * @rmtoll OPTR1        IWDG_STOP          LL_FLASH_GetIWDGInStop
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_IWDG_INSTOP_FREEZE
  *         @arg @ref LL_FLASH_IWDG_INSTOP_ACTIVE
  */
__STATIC_INLINE uint32_t LL_FLASH_GetIWDGInStop(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_IWDG_STOP);
}

/**
  * @brief Get IWDG In Standby
  * @rmtoll OPTR1        IWDG_STDBY          LL_FLASH_GetIWDGInStandby
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_IWDG_INSTANDBY_FREEZE
  *         @arg @ref LL_FLASH_IWDG_INSTANDBY_ACTIVE
  */
__STATIC_INLINE uint32_t LL_FLASH_GetIWDGInStandby(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_IWDG_STDBY);
}

/**
  * @brief Get NRST STOP Mode
  * @rmtoll OPTR1        NRST_STOP          LL_FLASH_GetStopReset
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_STOP_RST
  *         @arg @ref LL_FLASH_STOP_NORST
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSTOPReset(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_NRST_STOP);
}

/**
  * @brief Get NRST STDBY Mode
  * @rmtoll OPTR1        NRST_STDBY          LL_FLASH_GetStandbyReset
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_STANDBY_RST
  *         @arg @ref LL_FLASH_STANDBY_NORST
  */
__STATIC_INLINE uint32_t LL_FLASH_GetSTANDBYReset(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_NRST_STDBY);
}

/**
  * @brief Get RDP Level
  * @rmtoll OPTR1        RDP          LL_FLASH_GetRDP
  * @param  FLASHx FLASH Instance
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_RDP_LEVEL_0
  *         @arg @ref LL_FLASH_RDP_LEVEL_1
  */
__STATIC_INLINE uint32_t LL_FLASH_GetRDP(FLASH_TypeDef *FLASHx)
{
  return READ_BIT(FLASHx->OPTR1, FLASH_OPTR1_RDP);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
#endif /* defined (FLASH) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* PY32E407_LL_FLASH_H */

/************************ (C) COPYRIGHT Puya *****END OF FILE******************/
